from tasks_lesson_12_1 import Product, Pizza, Coffee

products = [Product(6502, 'стульчик', 12.25),
            Product(6501, 'стул', 26.50),
            Pizza(6605, 'пицца', 12.66, ['сыр', 'ананас', 'грибы', 'креветки'], 'острая', 12),
            Pizza(6606, 'пицца', 12.66, ['сыр', 'грибы', 'креветки', 'устрицы', 'помидоры'], 'не острая', 15),
            Coffee(8844, 'кофе', 2.66, 0.33, 'с сахаром', 'классическое'),
            Coffee(8845, 'кофе', 2.06, 0.05, 'без сахара', 'арабика'),
            ]
